{"meta":{"title":"岛","subtitle":"面朝大海，春暖花开","description":"Hexo主题Ayer中文说明","author":"Eric Shen","url":"https://shen-yu.gitee.io","root":"/"},"pages":[{"title":"categories","date":"2020-02-09T04:00:54.775Z","updated":"2020-02-09T04:00:54.775Z","comments":true,"path":"categories/index.html","permalink":"https://shen-yu.gitee.io/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2020-02-09T04:01:01.219Z","updated":"2020-02-09T04:01:01.219Z","comments":true,"path":"tags/index.html","permalink":"https://shen-yu.gitee.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"生活杂记","slug":"生活杂记","date":"2020-05-27T15:28:58.000Z","updated":"2020-06-28T14:22:58.855Z","comments":true,"path":"2020/zaji/","link":"","permalink":"https://shen-yu.gitee.io/2020/zaji/","excerpt":"人，生来就是一座孤岛，经历多了，这条道理才体味地越发深刻… 离上一次写博文已经快半年了，个人觉得博客不需要刻意逼自己去写，随心就好，有所想就有所写。这个站点本来只是用来演示Ayer主题的，所以只加了几篇游记，现在想着再加点生活随笔应该也不错，因为文章写出来就是给别人看的。 首先是比较高兴的事情，Ayer主题获得了很多朋友的喜欢，在此要感谢大家，每个star每条评论每封邮件每次打赏，都让我更有动力来维护这个主题，虽然折腾主题比较耗时间，但我依然会采纳一些必要的建议，在此期间一些朋友有疑问也会加我微信和qq，我都表示很欢迎并且会耐心解答。至今已经有上千个站点采用了Ayer主题搭建，其实我觉得Hexo不仅适合做博客站，也适合做企业站以及其他用途的展示类站点，相比其他博客系统如wordpress和hugo，Hexo在轻量性和扩展性方面做到了很好的平衡，而且源码也很容易看懂。","text":"人，生来就是一座孤岛，经历多了，这条道理才体味地越发深刻… 离上一次写博文已经快半年了，个人觉得博客不需要刻意逼自己去写，随心就好，有所想就有所写。这个站点本来只是用来演示Ayer主题的，所以只加了几篇游记，现在想着再加点生活随笔应该也不错，因为文章写出来就是给别人看的。 首先是比较高兴的事情，Ayer主题获得了很多朋友的喜欢，在此要感谢大家，每个star每条评论每封邮件每次打赏，都让我更有动力来维护这个主题，虽然折腾主题比较耗时间，但我依然会采纳一些必要的建议，在此期间一些朋友有疑问也会加我微信和qq，我都表示很欢迎并且会耐心解答。至今已经有上千个站点采用了Ayer主题搭建，其实我觉得Hexo不仅适合做博客站，也适合做企业站以及其他用途的展示类站点，相比其他博客系统如wordpress和hugo，Hexo在轻量性和扩展性方面做到了很好的平衡，而且源码也很容易看懂。 另一方面，因为年后炒股亏了点钱，所以我开始去深入了解该怎么降低投资风险，后来接触到了python进行数据分析，感觉发现了新大陆，很方便也很实用，有点相见恨晚的感觉，虽然掌握到目前还只限于基本的数据分析和数据可视化。量化投资的话，交易模型才是灵魂，而这个模型需要时间慢慢去回测和反复验证。数据分析用来助力价值投资倒是不错，其实生活中的许多事情都可以用数据方法论来做决策。反正我越来越觉得，学技术是为了解决实际问题和帮助自己更好的决策，而不是为了学而学，更不是为了装逼。对数据分析方面有研究的朋友欢迎在此留言，我们可以互相交流心得。 再说说个人生活，最近比较丧的事情就是对爱情和婚姻的迷茫了，由于家里催促，从去年到现在也被逼陆续相了几个妹子，但都一直没有成功。有的女生一见面就让你感觉三观不符，有的是确实喜欢不起来，总得来说就是，还没遇到心动的，而对我心动的我又没感觉，所以我对爱情的期待也在慢慢降低，对婚姻就更是没有考虑清楚了。从民政部网站虽然只能查到18年的数据，但可以明显看到结婚率和离婚率越靠越近了，归根结底是我们越来越不想谈恋爱了，并且有越来越多的人认识到了婚姻的收益率越来越低。 知乎上看到一个问题：恐婚是一种什么体验。一答案很赞同：大多数人害怕的是婚姻的实质吧，我害怕的只是婚姻的形式，以及这种形式带来的社交压力。我觉得大概我也产生了恐婚的心理吧。 今年确确实实是一个灾年，疫情让很多人都失业破产，要不是政府出面积极调控，情况会比现在更糟糕。杭州这边政府已经发了好几轮消费券，领导们也积极在抖音开直播卖货，可以看到当金融危机来临时，电商的生命力显现出来优势。这一轮疫情也告诉人们一个道理，就是未来几年失业会常态化，作为打工仔最好不要裸辞，猥琐发育，已经失业的话减少焦虑加强学习，多思考赚钱方法。并不是金融危机来了就是坏事，相反，对某些人来说危机就是机会，在这次疫情中亲眼看到一些人囤口罩囤熔喷布赚钱，也有很多人炒医药股炒粮食股赚钱。另一边，很多外贸厂因为不求思变而裁员倒闭，很多贷款买房的因为债务压身而一夜白发。 我所在的互联网行业也能感受到挺大的冲击，各大厂有的裁员有的缩招，今年的应届毕业生真是最惨的一届了。此一时彼一时，遥想5年之前的互联网，那时你只要稍微自学一下就有很多公司愿意要你，而现在的面试不是问算法就是源码，所以建议打算转行程序员的朋友要做好思想准备，如果不是真的热爱，真的不建议来了，我现在就时常有疲惫感，时常担心某一天自己学不动，那时可能会回绍兴自己做点小生意，或者找个轻松点的活儿。想到这，我忽然觉得婚姻最大的好处就是能给人心安，用不着孤身漂泊，失业了至少有另一半一起承担，也有人帮你分担身心压力，而回到现实，大多数“后浪”们还在为了攒钱娶妻省吃俭用租几百块的房子，婚姻就是围城，像极了996的阿里，有些想进去，有些想出来，有些根本没想过进去。 以上有些是较为悲观的牢骚，有些是亲眼所见的现实，各位朋友有所启发更好，一看了之也罢。 上图是年初以来的“失业金”和“破产”关键词的百度搜索指数","categories":[{"name":"生活","slug":"生活","permalink":"https://shen-yu.gitee.io/categories/%E7%94%9F%E6%B4%BB/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://shen-yu.gitee.io/tags/%E9%9A%8F%E7%AC%94/"},{"name":"生活","slug":"生活","permalink":"https://shen-yu.gitee.io/tags/%E7%94%9F%E6%B4%BB/"}]},{"title":"Ayer中文说明","slug":"Ayer中文说明","date":"2019-12-03T05:26:02.000Z","updated":"2020-06-28T14:11:15.417Z","comments":true,"path":"2019/ayer/","link":"","permalink":"https://shen-yu.gitee.io/2019/ayer/","excerpt":"介绍 Ayer 是一个干净且优雅的Hexo主题，自带响应式，加载速度很快，该有的功能都有，可配置项很多，非常适合作为你的博客主题，主题内还附送了6张精美的高清壁纸。欢迎使用和Star支持，如果你在使用过程中有任何疑问或者建议，欢迎联系我！如果你的博客采用了本主题，欢迎在下面评论区留下地址~ Ayer 在马来语中是“水”的意思，在西班牙语中是“昨天”的意思。 GitHub地址 国内镜像 效果预览 中文说明","text":"介绍 Ayer 是一个干净且优雅的Hexo主题，自带响应式，加载速度很快，该有的功能都有，可配置项很多，非常适合作为你的博客主题，主题内还附送了6张精美的高清壁纸。欢迎使用和Star支持，如果你在使用过程中有任何疑问或者建议，欢迎联系我！如果你的博客采用了本主题，欢迎在下面评论区留下地址~ Ayer 在马来语中是“水”的意思，在西班牙语中是“昨天”的意思。 GitHub地址 国内镜像 效果预览 中文说明 特性 干净且优雅，文章内容美观易读 首页封面全屏平铺，扁平化设计，简洁又不失高大上 响应式设计，博客在桌面端、平板、手机等设备上均能很好的展现 首页封面和文案可以任意更换，主题内附送6张精美高清壁纸 时间轴式的归档页 支持 黑夜阅读 模式 侧边栏可以点击显示或隐藏 支持文章置顶和文章打赏 支持文章字数和阅读时长统计 支持网易云音乐播放 支持 MathJax 和 Katex 数学公式 TOC 目录在文章页悬浮，跳转更方便 可设置阅读文章时做密码验证hexo-blog-encrypt Valine和Gitalk评论模块（推荐配合leancloud使用 Valine） 集成了不蒜子、百度统计、Google Analytics、CNZZ等统计功能 支持Github Ribbons 如果想体验手机端浏览效果，可以扫一下二维码： 打赏本主题完全开源且免费，目前由我一个人维护，如果你觉得主题不错，你可以选择继续白嫖，也可以选择适当打赏我，不在于金额多少，而是能让我更有动力去维护这个主题。打赏请备注说明，谢谢~ 微信 支付宝 安装12# 国内用户如果速度较慢，可以把github地址替换为：https://gitee.com/mirrors/ayer.gitgit clone https://github.com/Shen-Yu/hexo-theme-ayer.git themes/ayer 修改将博客根目录下的 _config.yml 里的 theme 值修改成 ayer 1theme: ayer 更新更新主题可能会覆盖你之前改动过的config文件，建议先把config.yml里的配置备份一下，然后删掉ayer目录后重新git clone下载主题，再把配置复制进去。 12cd themes/ayergit pull 主题配置以下是ayer主题目录下的 _config.yml文件配置，请先确保你已经读过Hexo文档。如果你在配置过程中有问题，请先擅用 搜索引擎。如果你搜不到解决方法，你可以参考：我的博客源码，按照我的一模一样配肯定是不会有问题的。如果对部分字体或颜色等有定制需求，请自行在css文件进行修改，主题本身已经很符合审美，自定义配置项也很多，不建议改得花里胡哨，过大的字体和库都会影响博客加载速度。如果还有问题或者建议，那么请在评论区给我留言~ 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142143144145146147148149150151152153154155156157158159160161162163164165166167168169170171172173174175176177178179180181182183184185186187188189# 侧边栏菜单menu: 主页: / 归档: /archives 分类: /categories 标签: /tags 摄影: http://shenyu-vip.lofter.com 旅行: /tags/旅行/ 关于我: /2019/about# 站点次标题和打字动效# https://github.com/mattboldt/typed.jssubtitle: enable: true # 是否开启动效 text: 面朝大海，春暖花开 # 显示的文字 text2: 愿你一生努力，一生被爱 # 滚动播放，如果不需要可以留空 text3: 想要的都拥有，得不到的都释怀 # 最多支持三段文字 startDelay: 0 # 延迟时间 typeSpeed: 200 # 打字速度 loop: true # 是否循环 backSpeed: 100 # 回退速度 showCursor: true # 是否显示光标# 网站图标和侧边栏logofavicon: /favicon.icologo: /images/ayer-side.svg# 封面配置# enable-是否启用封面；path-封面背景图；logo-封面logocover: enable: true path: /images/cover1.jpg # /source/images目录下附送多张精美壁纸，可任意更换 logo: /images/ayer.svg # 如果不要直接设置成false# 页面顶部进度条 progressBar: true# 网易云音乐插件music: enable: false # 播放器尺寸类型(1：小尺寸、2：大尺寸) type: 1 id: 518895142 # 网易云分享的音乐ID(更换音乐请更改此配置项) autoPlay: true # 是否开启自动播放# 文章配置# 文章太长，截断按钮文字(在需要截断的行增加此标记：&lt;!--more--&gt;)excerpt_link: 阅读更多...# 如果你嫌每篇文章手动加more标记比较麻烦，又不想在首页全文显示，可以把excerpt_all设置成true，这样首页只会显示文章归档excerpt_all: false# 是否开启代码复制按钮copy_btn: true# 是否开启文章分享按钮share_enable: true# 国内的社交平台(If you are not in China, maybe you prefer to set:false)share_china: true# 文章分享文字share_text: 分享# 分页文字nav_text: page_prev: 上一页 page_next: 下一页 post_prev: 上一篇 post_next: 下一篇# 文章页是否显示目录toc: true# 文章中的图片是否支持点击放大image_viewer: true# https://github.com/willin/hexo-wordcount# 是否开启字数统计(关闭请设置enable为false)# 也可以单独在md文件里Front-matter设置`no_word_count: true`属性，来自定义关闭字数统计word_count: enable: true # 只在文章详情显示(不在首页显示) only_article_visit: true# 打赏# 打赏type设定：0-关闭打赏； 1-文章对应的md文件里有reward:true属性，才有打赏； 2-默认开启所有文章均有打赏，如果有些文章你不需要，请在文章对应的md文件里设置no_reward:truereward_type: 1# 打赏wordingreward_wording: '请我喝杯咖啡吧~'# 支付宝二维码图片地址，跟你设置logo的方式一样。比如：/images/alipay.jpgalipay: /images/alipay.jpg# 微信二维码图片地址weixin: /images/wechat.jpg# 版权声明# 版权声明type设定：0-关闭版权声明； 1-文章对应的md文件里有copyright: true属性，才有版权声明； 2-所有文章均有版权声明copyright_type: 2# 是否启用搜索search: true# RSS订阅(先安装hexo-generator-feed插件，再去博客根目录config进行配置)# 不想显示可以直接留空rss: /atom.xml# 是否启用黑夜模式开关darkmode: true# 动态背景效果: 0-关闭，1-动态线条(跟随鼠标)canvas_bg: 0# 自定义鼠标样式，直接替换/images/mouse.cur文件mouse: enable: false path: /images/mouse.cur# 鼠标点击效果：0-关闭，1-爱心，2-爆炸烟花，3-粒子烟花click_effect: 0# 页面宽度自定义（不建议修改，可能造成布局混乱），article_width文章宽度，sidebar_width侧边栏宽度layout: article_width: 80rem sidebar_width: 8rem # 评论：1、Valine(推荐)；2、Gitalk# 1、Valine[一款快速、简洁且高效的无后端评论系统](https://github.com/xCss/Valine)# 启用Valine必须先创建leancloud应用， 注册账号后获取 id|key 填入即可leancloud: enable: true app_id: # app_key: ## Valine配置(如果有些文章你想关闭评论，请在文章对应的md文件里设置no_valine:true)valine: enable: true # 是否启用 verify: false # 是否开启防垃圾评论验证 notify: false # 是否开启邮件提醒(https://valine.js.org/notify.html) avatar: mp # 头像样式(https://valine.js.org/avatar.html) placeholder: 给我的文章加点评论吧~ # placeholder# 2、Gitalk(https://github.com/gitalk/gitalk)gitalk: enable: false # true clientID: # GitHub Application Client ID clientSecret: # Client Secret repo: # Repository name owner: # GitHub ID admin: # GitHub ID # GitHub Ribbons-封面右上角的forkme，换样式直接在source/images目录下替换forkme图片github: # (关闭请设置为false) url: https://github.com/Shen-Yu/hexo-theme-ayer# fancybox(仅用于相册展示，若需要可配置albums)fancybox: true# 访问量统计(不蒜子)busuanzi: enable: true# 友盟cnzz统计(url填js代码src链接)cnzz: enable: true url: ## Google Analyticsgoogle_analytics: ''# 百度统计baidu_analytics: ''# Mathjax数学公式mathjax: true# Katex数学公式(allpost设置为false时只有头部设置math:true的文章才开启)# 需要更换hexo渲染器，npm un hexo-renderer-marked -S &amp;&amp; npm i hexo-renderer-markdown-it-katex -Skatex: enable: false # true allpost: true copy_tex: false# 网站成立年份(默认为 2019，若填入年份小于当前年份，则显示为 2018-2019 类似的格式)since: 2019#是否显示页脚信息(建议保留，有助于本主题的推广)pageFooter: true#ICP备案信息尾部显示icp: enable: false url: 'http://www.beian.miit.gov.cn/' # 备案链接 text: '浙ICP备88888888' # 备案信息 插件(必需) hexo-generator-searchdb 用于搜索 1npm install hexo-generator-searchdb --save 然后将以下配置复制到你博客根目录下的 _config.yml 里（注意不是ayer目录下的）: 12345# hexo-generator-searchdbsearch: path: search.xml field: post format: html hexo-generate-feed 用于生成RSS订阅 1npm install hexo-generator-feed --save 然后将以下配置复制到你博客根目录下的 _config.yml 里（注意不是ayer目录下的）: 123456789feed: type: atom path: atom.xml limit: 20 hub: content: content_limit: 140 content_limit_delim: ' ' order_by: -date 插件(可选) hexo-generator-index-pin-top 用于文章置顶 hexo-blog-encrypt 用于文章加密 hexo-tag-aplayer 用于播放音乐 hexo-tag-dplayer 用于播放视频 hexo-helper-live2d 二次元看板娘 更多插件请见 hexo插件市场 分类1hexo new page categories 然后将以下复制到/source/categories/index.md文件 12345---title: categoriestype: \"categories\"layout: \"categories\"--- 标签1hexo new page tags 配置同分类一样 相册1hexo new page photos 然后将以下复制到/source/photos/index.md文件，img_url替换成图片路径，caption替换成图片名称 12345678---title: Galleryalbums: [ [\"img_url\",\"img_caption\"], [\"img_url\",\"img_caption\"] ]--- 文章目录用Tocbot解析文章标题并生成目录 将以下配置复制到你ayer目录下的 _config.yml 里： 12# Toc toc: true 当然你可能并不想所有文章都生成悬浮目录，你可以在文章顶部的配置中加一行来进行关闭： 123---no_toc: true--- 常见问题一.本地图片引用了却无法显示 插入图片的两种方法：1.引用图床，2.引用本地图片。为了防止路径出错，建议使用图床。 1.图床推荐使用：SM.MS，聚合图床 2.本地图片建议在hexo创建的博客目录下的source中建立一个images文件夹专门放图片，路径：你的博客目录/source/images，如果还是无法显示，请尝试在文章里用html的img标签来引用本地图片。 二.可以启动但是样式变形了这很可能是因为你把博客部署到了服务器子目录，导致静态资源加载的路径不对，在此强烈建议你部署到根目录，github和码云都支持根目录部署，只要你把仓库名搞成和用户名一样就行了。 三.点击侧边栏页面无法显示原因：ayer主题目录下的 config.yml 里menu属性的路径不对，这需要你根据页面路径手动配置。 以我的博客为例： 12345678menu: 主页: / 归档: /archives 分类: /categories 标签: /tags 旅行: /tags/旅行/ 摄影: http://shenyu-vip.lofter.com 关于我: /2019/about 上面的归档/archives是固定的，你不需要修改，标签和分类都需要手动创建目录，旅行实际上就是一个标签页，当你在文章头部设置tags属性后就会自动生成，摄影是一个站外的绝对路径，关于我实际上就是一个正常的文章页。好了，现在一个侧边栏导航就已经配置好了。 四.为什么修改了配置却没有效果建议每次生成站点或部署之前都用 hexo clean 命令清理一下缓存，另外你可能还需要刷新一下。 五.怎么修改大标题和站点信息站点配置文件_config.yml是hexo站点根目录下的主配置文件(还不知道是哪里的，自己google)，注意：别和ayer主题目录下的_config.yml搞混了。 修改网站各种资料，例如标题、副标题和邮箱等个人资料，请修改站点根目录下的_config.yml 以我的博客为例： 六.怎么添加百度或谷歌统计百度统计在ayer的config配置里的baidu_analytics填上百度统计代码中的hm.js问好后面那一串东西 谷歌统计在ayer的config配置里的google_analytics填上谷歌统计代码的跟踪ID，即UA值(包含UA) 七.怎么查看文章的访问量在ayer的config配置里有busuanzi选项，默认设置为enable:true，就开启了站点访问量的统计，站点尾部左下角的PV代表了当前页的访问次数，UV代表了当前站点的访问人数。注意：不蒜子统计是根据当前域名来统计的，你在本地启动的时候由于是localhost，所以数字会很大，部署到线上之后就会根据域名重新统计。 八.网易云音乐无法播放这是由于网易云音乐对部分歌曲做了版权限制，你可以多换几首试试，配置文件里的默认歌曲 潮鳴り 是可以播放的。如果你动手能力强，也可以试试音乐播放插件 hexo-tag-aplayer，配合MetingJS可以支持对于 QQ音乐、网易云、虾米、酷狗、百度等平台的音乐播放。 九.分享链接无法打开你需要在根目录下的_config.yml文件中把url配置成部署后的域名。","categories":[{"name":"技术","slug":"技术","permalink":"https://shen-yu.gitee.io/categories/%E6%8A%80%E6%9C%AF/"}],"tags":[{"name":"技术","slug":"技术","permalink":"https://shen-yu.gitee.io/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"About Me","slug":"about","date":"2019-12-01T13:37:04.000Z","updated":"2020-03-24T14:15:06.898Z","comments":true,"path":"2019/about/","link":"","permalink":"https://shen-yu.gitee.io/2019/about/","excerpt":"A Coder, live in Hangzhou, China. 姓名：沈宇现居：杭州GitHub: Shen-Yutwitter: shenyu1995QQ: 448766534微信: yuknass","text":"A Coder, live in Hangzhou, China. 姓名：沈宇现居：杭州GitHub: Shen-Yutwitter: shenyu1995QQ: 448766534微信: yuknass","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://shen-yu.gitee.io/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"静享云南慢时光","slug":"静享云南慢时光","date":"2018-11-20T16:17:37.000Z","updated":"2020-05-28T15:09:32.713Z","comments":true,"path":"2018/yunnan/","link":"","permalink":"https://shen-yu.gitee.io/2018/yunnan/","excerpt":"当我坐着飞机掠过玉龙雪山，当我拿着杯子舀起泸沽湖水，当我沐浴阳光闻着洱海气息，当我立于海埂大坝望着海鸥随风翱翔，当我骑着自行车与彝族寨子擦肩而过……当我真正踏入这片土地，我发现它不仅仅是适合文艺小资青年，更适合热爱山水，热爱自由的背包客。","text":"当我坐着飞机掠过玉龙雪山，当我拿着杯子舀起泸沽湖水，当我沐浴阳光闻着洱海气息，当我立于海埂大坝望着海鸥随风翱翔，当我骑着自行车与彝族寨子擦肩而过……当我真正踏入这片土地，我发现它不仅仅是适合文艺小资青年，更适合热爱山水，热爱自由的背包客。 由于这篇游记中涉及到好几个目的地，每个目的地又有很多照片，为了不影响游记的易读性和美观性，我把很多照片都拼接了起来。下面开始。 丽江杭州到丽江4个小时左右的飞程，我却觉得漫长，迫不及待要一睹丽江的芳容。一进入云贵地区，从飞机小窗往下看，入眼皆是山水，当飞机掠过玉龙雪山的那一刻，更是对接下来的行程充满了期待。以上是玉龙雪山的面貌，这还是前一天刚下过雪的样子，据说雪山上的积雪线在逐年升高。下午到达丽江之后就找了个古城旁的客栈放行李，然后趁着午后阳光尚未离去，直奔古城内部。整体来讲，确实是很适合文艺青年的一座小城，古城里面很多酒吧和客栈，白天可以随手找个地方发呆晒太阳听民谣，里面也有很多小店，店里卖的都是小清新小文艺的玩意儿，怪不得好多文青来了这里之后就直接在这开客栈了，这里时光过得很慢，每个人的生活节奏也很慢，连门口的二哈也惬意得很。丽江应该是全国最适合发呆的一座城市了。 夜幕降临，它又从静谧转向了不羁，每个人都在这酒吧的灯红酒绿中沉醉，人都说丽江是艳遇之都，果真不假。 泸沽湖体验完丽江古城的日与夜，我打算去泸沽湖看看，网上总说，去丽江不去泸沽湖那等于是白去了。对于这个横陈于滇川边界的神秘湖泊，我在来之前其实并没有多少了解，只晓得它身处少数民族自治区，只晓得它值得一去。当我坐着中巴穿过4个小时的十八弯山路后，当我一眼瞥到它，就被惊艳了。首先，它足够静，大概是由于地理偏僻，虽然被云南旅游业大力推荐着，但它那份宁静还是没能被破坏，正如它的湖面那样波澜不惊。其次，它足够清，湖水的能见度可以说是云南这么多湖里数一数二的，而且湖水是可以直接饮用的。当然，这里也极具少数民族文化，集结了蒙古族，纳西族等多个民族的文化，这里每晚有摩梭族的篝火晚会，摩梭姑娘身着靓丽的民族服饰，优美的身姿配上泸沽湖水，又是一幅别致的画。 从丽江古城去泸沽湖可以在汽车站坐大巴，也可以网上订，也可以包车去，更可以自驾去。我是从云南旅游网的公众号订的，来回130，早上8点半从古城开出，路上经过金沙江司机会停下来让拍照，山上由于缺水，休息站的厕所都是要收费1块钱的。一程山路，到12点半才到。下午回来也有一班，1点半从泸沽湖开出，5点半到古城。来回票要和司机讲好在哪一天回来。我在泸沽湖只过了一夜，第二天就回来了，现在想起来还是比较后悔的，湖边可以租自行车，一天30，绕着湖可以骑一圈，而我只花了一下午从大落水村骑到草海就回来了。一路的风景自然不必说，从山路上可以远看泸沽湖水，路上也可以看到很多田地，很多纳西族的寨子，走近了看还有当地人开的小店，物价比几个景点村要便宜很多。一路上就是上下坡比较多比较累，环湖公路有70多公里，全程骑下来应该要两天。 大理从泸沽湖回到丽江，因为第二天要去大理，就在丽江火车站旁睡了一夜，其实睡在古城旁早起打车也来得及。从丽江去大理的火车一天只有两趟，一趟是早上7点，一趟是傍晚4点。 到大理才上午9点，于是坐大巴去挖色，因为看网上的攻略说双廊那边在修路景色也没挖色原生态，所以此行就选了挖色作为看洱海的一个重要目的地。从大理火车站去各个景点的车都很多，去挖色的大巴是从大理交通运输集团那边坐，从火车站出来后右转就可以看到那个集团的大厦，11块钱一个人。不得不说，大理当地人还是挺好的，期间我在回来的路上把手机落在另一个大巴上了，那个售票阿姨就让司机在下一趟给送过来了，挺令我感动。还有是我把冲锋外套落在去大理古城的8路车上了，后来几经周折也算是找回来了。 大理洱海和泸沽湖有相似的地方也有不同的地方。同样是那么平静，平静到能把你的心安抚下来，但洱海多了一丝浪漫气息，去挖色的环湖公路上可以看到岸边有许多情侣在拍婚纱照，在挖色，还多了几只生锈停在岸上的小舟，配上绿草地与碧波与芦苇，远处云朵戴在山顶上，更添一丝浪漫。 洱海环湖可以租个电动车或者租个小汽车，但要注意提前拍好车身防止回来被坑。第二天晚上8点的动车去昆明，原先想着就在挖色过一夜，但来大理难道只是看洱海吗，当然不是的。于是看过洱海就回火车站，再从火车站坐上8路车去大理古城，晚上下榻在古城边。大理古城总体来说没啥看点，就随便逛逛古城内的小店，古城后面有三塔可以去看看，但买门票进去我感觉还是不值得。有特色的还是这边的饵丝（和面条差不多，就是大米做成的，更加香软），上面有耙肉，并且可以随便加菜。来大理的第二天，我一日三餐都吃的是饵丝哈，感觉吃不腻。 第二天早上我想着既然古城没啥好玩的，就跑去喜洲古镇看看。从古城去喜洲古镇的交通可以选择在大丽线上招手拦路过的大巴，也可以直接在古城出来那个岔口打的，打的不贵，拼车过去一个人10元，大巴过去是7元。 喜洲古镇东临洱海，西枕苍山，这里有保存完好的白族民居建筑群。整个古镇不大，半天就可以逛完，贯穿着多条集市，有卖特色丝巾披肩服饰的，也有卖当地特色小吃喜洲粑粑的，很是热闹。我在那边吃着饵丝晒了一下午的阳光，十分惬意。 昆明从大理到昆明过去只有绿皮火车，现如今在铁路工人的辛勤开辟下，有了直达的动车，时间缩短了一半都不止。到昆明已经是晚上10点，在火车站旁随便找了个旅馆休息。第二天从火车站坐24路公交去海埂公园，因为之前在抖音看网友在海埂大坝拍的很好看，就觉得一定要去。去了之后果然没令我失望，成群的海鸥在岸边飞来飞去，等游客喂食，这里的海鸥大概早已习惯了被人喂，一点也不怕人，只要有食物还会停在你手上。海埂大坝上的风景比公园内更为壮观，成群的海鸥拍打着翅膀来回翱翔，堤岸上还有高倍望远镜供游客观赏（4元钱看2分钟）。 看完海鸥我便坐索道上了西山，在西山上可以看到半个滇池半个春城，西山上面有直接下山的大巴，下来后我坐上地铁去了翠湖公园，顺便看看陆军讲武堂，这个讲武堂是免费开放的，与西南联大被称为是云南一文一武的两所历史名校，同时也出了很多伟人。逛完陆军讲武堂已经是傍晚5点，趁着夜色尚未降临，去看了隔壁的西南联大，西南联大如今只剩下旧址了，坐落在现在的云南师范大学里，逛逛看看，追忆一下英雄，从师范大学出来有一条文化巷，就在云南大学后面，到了晚上会有许多学生出来摆地摊，也值得逛一下。因为第二天晚上就要离开昆明去黔东南了，所以就回到火车站旁的旅馆又睡了一夜，第二天白天去抚仙湖。 抚仙湖抚仙湖，相较于昆明滇池，就少为世人所知了，但这里的湖水清澈到能和泸沽湖比肩。古人称之为“琉璃万顷”。它位于玉溪澄江县，是我国最大蓄水量的湖泊、最大的高原深水湖。和泸沽湖不同，这里沿岸有不少人造沙滩和秋千，还有钓鱼的老年人，景色更加多样化。 从昆明去泸沽湖需要在昆明汽车南站坐开往澄江的大巴，车是坐满才走的，所以来回都最好预留一个小时，我上午9点到那，司机10点才开。票价来回都是20，全程高速，不到一小时就到了。淡季像我这种专门为了去看看抚仙湖的人极少，车上基本都是当地人。从澄江汽车站下来最好直接打车去最近的湖边，因为那边虽然有公交，但公交站很难找，而且到公交站还需要走一段路。回来倒是可以坐公交，2路和8路都是开往县城的，拦车投币就行了。 我从澄江汽车站打车到抚仙湖公园是15块，下来之后旁边就有个人工沙滩，上面有很多水上车停着，还有几个秋千。我先是沿着湖边往西走，那边沙滩上有一艘白色小舟和一个白色门框，配上抚仙湖的湖水泛起浪花，十分浪漫，还遇到有一对情侣正在那拍婚纱照，走到望海公园我再一路向东走到月亮湾湿地公园。一路上的美景就更多了，有木栈道有独木舟有水中树，甚至令我有一种在东南亚海滩边漫步的感觉。沙滩上的秋千在旺季是要收费的，淡季没人收费，我坐在那秋千上发了很久的呆。 我这一趟在云南花的时间才6天，好几个地方也只是走马观花，总体来讲，它真的是一个很适合安静发呆的地方，这里的每一片湖水每一寸阳光每一座山头，都值得你去发几天呆。 另外我这一趟还一路向东去了黔东南和湘西，那两篇游记可以在我的主页找到。","categories":[{"name":"旅行","slug":"旅行","permalink":"https://shen-yu.gitee.io/categories/%E6%97%85%E8%A1%8C/"},{"name":"国内","slug":"旅行/国内","permalink":"https://shen-yu.gitee.io/categories/%E6%97%85%E8%A1%8C/%E5%9B%BD%E5%86%85/"}],"tags":[{"name":"旅行","slug":"旅行","permalink":"https://shen-yu.gitee.io/tags/%E6%97%85%E8%A1%8C/"},{"name":"国内","slug":"国内","permalink":"https://shen-yu.gitee.io/tags/%E5%9B%BD%E5%86%85/"}]},{"title":"原汁原味黔东南","slug":"原汁原味黔东南","date":"2018-11-20T16:15:20.000Z","updated":"2020-05-28T15:09:39.940Z","comments":true,"path":"2018/qiandongnan/","link":"","permalink":"https://shen-yu.gitee.io/2018/qiandongnan/","excerpt":"从昆明向东过来，我预选的目的地有两个，都匀和凯里。到都匀的话去荔波比较方便，到凯里的话去看黔东南苗寨比较方便。考虑到荔波在南边，而且交通不是很方便（目前正在建凯里到荔波的大路，建成后大巴过去还是挺方便的），如果从都匀过去的话也会浪费几天时间，所以就留下了这一程最遗憾的一点，就是没能去荔波看看喀斯特地貌（其实来之前我对荔波已经做足了攻略）。好在这一点遗憾马上就被朗德和镇远给弥补了。","text":"从昆明向东过来，我预选的目的地有两个，都匀和凯里。到都匀的话去荔波比较方便，到凯里的话去看黔东南苗寨比较方便。考虑到荔波在南边，而且交通不是很方便（目前正在建凯里到荔波的大路，建成后大巴过去还是挺方便的），如果从都匀过去的话也会浪费几天时间，所以就留下了这一程最遗憾的一点，就是没能去荔波看看喀斯特地貌（其实来之前我对荔波已经做足了攻略）。好在这一点遗憾马上就被朗德和镇远给弥补了。 朗德苗寨相较于西江千户苗寨的喧嚣与商业化，朗德苗寨则显得安静许多，它很多地方也保留了原汁原味的苗族特色。例如十二道拦路酒，例如手工制作苗族银首饰。这也是我考虑再三都想去的原因。虽然餐饮住宿和西江千户比起来差很多，夜景应该也要差很多，但我觉得苗寨应当是原生的才最值得一去。 去朗德苗寨很方便，可以从凯里汽车站坐中巴直接过去，从早上7点开始，大约2小时一班，来回都是10块钱，平时没什么人，基本都是当地人在来回。中巴是沿着山路盘旋开上去的，一路上经过南花苗寨和季刀苗寨，都是很原生，小众安静的苗寨，山顶云雾缭绕，溪水在村寨门口流过，苗族姑娘在溪边拍打衣服，这种场景绝对令每个游客都神往，路上遇到美好的画面可以让司机停下然后下车逛逛，坐下一班再去朗德。班车从汽车站大概一个小时到朗德，我来的时候正好旅游淡季，下了中巴，感觉整个苗寨都是属于自己的。也有游客中心啥的设施，但朗德还是保留着大部分完整的味道。 下了中巴往大寨门口走进去是朗德下寨，可以随便逛逛，最美的是朗德上寨，需要沿着公路自己走过去大概几百米，或者可以坐游览车过去。我当时走错了，把上面有个什么雷寨错当成朗德上寨了，后来从山上走下来，多花费了不少力气。注意，朗德上寨和下寨中间隔了一段公路的，你可以沿着下了车后的大寨门下面的溪水，一路走过去。 下寨到上寨的这段路，风景也不错，主要是溪水潺潺。 这就是朗德上寨，门口有个石牌，因为08年的时候奥运圣火也经过这儿，所以雕刻着圣火和奥运五环。朗德上寨的表演场，上午10点左右和下午3点多各有一场表演的。 以上便是朗德上寨的风光了，从朗德回凯里的班车最迟是傍晚4点半。如果错过了就选择住在寨里吧，客栈也是有不少的。整体来讲，朗德就是一个正转型旅游化但尚且少为人知的一个小村寨。 镇远古镇镇远，相较于朗德，知名度就大了很多，交通餐饮住宿十分齐全，火车站汽车站公交，样样齐全，每天都有来自四面八方的游客为它而来。位于舞阳河畔，四周皆山。河水婉婉，这里的古建筑群依山傍水，这里的居民每天过得十分惬意。镇远古镇是属于那种虽然被人声打扰，但却更显韵味的地方。夜色中的镇远灯火相映，辉煌如画，仿佛代表了整个黔东南，想向你慢慢诉说这里的故事。这里的小吃特产，你都能随手在街上选出一家店来去细细品尝。 白天，日光下的镇远脱去了夜晚闪耀的礼服，露出它安静温婉的一面，碧绿的舞阳河水映出她的脸庞。这里的居民每天跳跳舞下下棋钓钓鱼，好不快活！","categories":[{"name":"旅行","slug":"旅行","permalink":"https://shen-yu.gitee.io/categories/%E6%97%85%E8%A1%8C/"},{"name":"国内","slug":"旅行/国内","permalink":"https://shen-yu.gitee.io/categories/%E6%97%85%E8%A1%8C/%E5%9B%BD%E5%86%85/"}],"tags":[{"name":"旅行","slug":"旅行","permalink":"https://shen-yu.gitee.io/tags/%E6%97%85%E8%A1%8C/"},{"name":"国内","slug":"国内","permalink":"https://shen-yu.gitee.io/tags/%E5%9B%BD%E5%86%85/"}]},{"title":"大美湘西","slug":"大美湘西","date":"2018-11-20T16:13:57.000Z","updated":"2020-05-28T15:05:14.783Z","comments":true,"path":"2018/xiangxi/","link":"","permalink":"https://shen-yu.gitee.io/2018/xiangxi/","excerpt":"为什么先写这篇？因为湘西是我云贵湘之行的最后一站，刚出怀化火车站，我对它的印象是很差的，首先是有很多莫名其妙的人会把你围得透不过气，各种请你住宿吃饭打车，甚至我在怀化汽车站上厕所还向我收费（我当然没有给）。之后我去了凤凰古镇，到的时候正好是晚上，周遭一片漆黑，只有中心地带比较热闹，古镇里还有小女孩强行推销鲜花，和苗族姑娘拍照也得收费。这是湘西给我的第一印象。就是商业化太严重了，我想，也或许是当地经济比较差的缘故吧。。这和政府在城市整治这方面有脱不开的关系。不过抛开这些不谈，整个湘西的风景还是值得一去的。","text":"为什么先写这篇？因为湘西是我云贵湘之行的最后一站，刚出怀化火车站，我对它的印象是很差的，首先是有很多莫名其妙的人会把你围得透不过气，各种请你住宿吃饭打车，甚至我在怀化汽车站上厕所还向我收费（我当然没有给）。之后我去了凤凰古镇，到的时候正好是晚上，周遭一片漆黑，只有中心地带比较热闹，古镇里还有小女孩强行推销鲜花，和苗族姑娘拍照也得收费。这是湘西给我的第一印象。就是商业化太严重了，我想，也或许是当地经济比较差的缘故吧。。这和政府在城市整治这方面有脱不开的关系。不过抛开这些不谈，整个湘西的风景还是值得一去的。 凤凰古镇到凤凰古镇有两个交通方式，一个是从怀化坐大巴，一个是从吉首坐大巴。凤凰并没有火车站，所以这两种方式其实都差不多都走的是高速，就看你从哪里方便了。由于我是从镇远古镇过来的，考虑到如果坐火车到吉首就是凌晨了不是很方便，而且逛完还得原路返回，所以我就直接从镇远坐火车到怀化，怀化再坐大巴去凤凰。怀化汽车西站离火车站很近，坐大巴大概一个多小时就到凤凰了。 我到凤凰已经是傍晚了，在这要注意，凤凰古镇的公共交通是很不方便的，一路走过去你可能找了好久也没有找到公交站牌在哪里，听说一路车是可以直接到凤凰古镇，不知道为啥，我等了很久也没有来，所以在凤凰古镇我唯一用到的交通工具是我的脚，当然你也可以打的或者和别人拼车过去，大概5块钱的样子，其实从汽车站走过去对于我这种习惯于徒步的人来说也算是近的，才2公里左右。 进了凤凰古镇，我差点以为我走错地方了。因为灯光实在是太暗，而且和网上看到的照片相差太远了吧。后来问了下客栈老板娘，说是旅游淡季就没全部开灯。晚上的景色确实是不如镇远古镇。 有灯光的地方都是一群中老年人挤着在拍照。 晚上逛了一圈看到这样的景象我便瞬间没了兴致，回客栈洗洗睡了。古城内的客栈还是很多的，价格也相对合理，怕被坑就从网上订，网上订的就要跟着地图找具体位置了。 第二天早上起来我就又去逛了，看到和昨晚截然不同的景象。。白天的凤凰古城还是挺美的哈。 整个古城不大，半天就能逛完，一条沱江将它分隔成一南一北。可以沿着沱江来回走一圈。江上有条石块搭成的小道，拍照的人挺多的，远看就像是走在江上，不过要注意安全小心别掉下去，沱江的水流还是很急的。 一路往东走可以看到湘西吊脚楼，排列在水上十分优雅。还能看到南华山上云雾缭绕，晴天是看不到的，阴雨天来凤凰正好，雾蒙蒙，多了一份朦胧感。 张家界国家森林公园来到湘西当然不可错过张家界，从凤凰古城过去还是很方便的，有直达的大巴，80元，也可以先花25元坐大巴到吉首，吉首再坐火车20元去张家界。我是选了后者，因为没去过吉首，正好一路过去看看，也相对便宜。 张家界有两个大型森林公园，需要区分开来。一个是天门山国家森林公园，坐索道就能直接到的，上面还有网红玻璃栈道，天门山索道离火车站很近，就在火车站出来再左转的大庸路上，索道缆车在火车站就能看到了，很长，有七千多米，是世界上最长的高山客运索道。比较适合文艺青年打卡，由于我这趟并没有去，所以无法深入介绍了。而且我觉得性价比不高，全程索道上下所以爬山乐趣也没了。另外一个就是我这次去的张家界国家森林公园，因为在武陵源区，所以也叫武陵源风景名胜区，这是张家界最出名的一个地方，比天门山要大好几倍，可玩性也大很多，如果背包客不到这个地方来算是白来张家界了。 虽然我在张家界森林公园只玩了两天，但是已经把里面的交通以及路线全部搞清楚了，每个大景点也一一走过。接下来我会将我所知道的全部告诉你，我还有一个安排得很好的路线分享，可以让你在最短的时间玩遍张家界。好了，废话不多说。 首先，张家界国家森林公园（以下简称张家界）的门票口总共有五个，除了上图中三个（森林公园，天子山，武陵源），其他在杨家界有个门票站，水绕四门下面也有一个。从火车站到张家界的班车只能去这三个门票站，车程一个小时左右，都是10来块钱。 这三个口相对来说，武陵源门票口最繁华，住宿吃饭的都很多，物价也相对便宜。天子山其次，森林公园就比较少了。我的路线是从森林公园进，天子山住宿一夜，武陵源出。当然你也可以反过来，也可以武陵源作为住宿站。但我不建议森林公园作为住宿站，因为查了一下，天子山和武陵源的客栈都比森林公园要便宜要多。网上也有说把丁香榕村作为住宿站点的，其实那边的客栈相对来说也贵，我个人觉得要是你想看日出日落那可以选择住那边。 下面说说各个景点和交通，这里面除了金鞭溪需要步行之外，其它都是可以通过景区环保车或索道或天梯去周转到达。（景区大门票225，和指纹绑定，4日内可以随便进出，包含了景区环保车，但不包括其它索道啥的） 黄石寨，金鞭溪和袁家界我认为可以连在一起逛完，因为黄石寨是独立的一个景点，上面还是值得一去的，可以上去绕一圈看看五指峰什么的，上下都有索道，步行爬上去得一个小时，也可以上去索道下来步行，但我不建议爬上去，首先这会耗费大量体力，影响到之后逛金鞭溪。黄石寨索道下站到森林公园门票口都有环保车，逛完之后回来，然后沿着金鞭溪走，一路上景色很美，还能看到猴子们在溪水边嬉戏，走到千里相会是一个分叉口，可以选择爬上乱窜坡直到袁家界，也可以选择继续沿着金鞭溪走，走到水绕四门，然后坐环保车去百龙天梯，百龙天梯直接到袁家界。逛完袁家界就没多少力气了，坐环保车去天子山门票口或者丁香榕村住宿吧。当然，我这是按两天的行程来安排的，你也可以放慢节奏，到了水绕四门直接坐环保车出武陵源口找住宿。 至于杨家界，可以安排到和天子山一起逛。因为杨家界里面的天波府爬起来还是很费力的，一路上都是怪石嶙峋，其中一条两石壁中间的路很窄。逛完杨家界应该也比较累了，坐上环保车去天子山索道站，逛一下贺龙公园看一下贺龙元帅铜像就坐索道下山，如果要爬下来也是很费力的，据说有7千多阶。坐索道下来时的风景很赞，可以近距离观赏张家界地貌。下来后还有精力的话就坐环保车去看看十里画廊，没精力了就直接出武陵源口，去张家界火车站大巴要去武陵源汽车站坐，需要向前走500米左右到汽车站，到此，一天的行程也就结束了。 以上，按照两天行程的安排，每个景点都逛了，如果觉得太赶，可以适当拆开来，也不会太累。 下面放照片(微笑) 黄石寨的风光是连张信哲都在坐过之后称赞不已的。上面两张是黄石寨上面的风光。张家界森林公园门口。以上是金鞭溪的风光。从乱窜坡上去之后，首先会看到第一张的指示牌，如果你从袁家界爬下来的话要注意向金鞭溪的方向走，至于迷魂台是袁家界里面一个小景点。再往上爬，出来就是一条公路，这条公路是给环保车行驶用的，往左边指示的方向走就是袁家界了。这上面还有个墓，我觉得挺神秘的，说这是啥龙脉地。阿凡达取景地。以上都是袁家界的风光。这张是杨家界天波府的风光，视野很开阔，只能拍全景照才能体现它的美。从杨家界进去到天波府的地势很艰险，而且越往后越艰险，其中一段路窄到只能允许一个人通过，因为我去的时候正好桥坏了，所以还得爬钢丝梯上去，老年人肯定是上不了天波府的。天子山上的贺龙公园。从天子山下去坐索道一路能看到不一样的景色，近距离观看红色的岩壁，繁茂的植被，能最大限度的还原张家界地貌。这也是我为什么推荐坐索道下去的一大原因。百龙天梯，世界上最高的户外电梯，世界第一梯。从山下到袁家界上面只要1分钟。最后从武陵源门票口出，门口住宿吃饭的地儿都挺多的，走不远处有个汽车站可以买到回市里的票。","categories":[{"name":"旅行","slug":"旅行","permalink":"https://shen-yu.gitee.io/categories/%E6%97%85%E8%A1%8C/"},{"name":"国内","slug":"旅行/国内","permalink":"https://shen-yu.gitee.io/categories/%E6%97%85%E8%A1%8C/%E5%9B%BD%E5%86%85/"}],"tags":[{"name":"旅行","slug":"旅行","permalink":"https://shen-yu.gitee.io/tags/%E6%97%85%E8%A1%8C/"},{"name":"国内","slug":"国内","permalink":"https://shen-yu.gitee.io/tags/%E5%9B%BD%E5%86%85/"}]},{"title":"雅加达出差记","slug":"雅加达出差记","date":"2017-12-24T03:05:25.000Z","updated":"2020-05-03T01:32:10.305Z","comments":true,"path":"2017/jakarta/","link":"","permalink":"https://shen-yu.gitee.io/2017/jakarta/","excerpt":"整理手机相册，发现还有一段回忆没整理，于是抽了这段闲暇时间把在 雅加达 的日子记录下来，希望有些经验也能帮到网友。 年初，因为出差的缘故，有幸去 雅加达 体验了一个多月的风土人情。刚开始我是十分不习惯的，毕竟异国他乡之前都没呆过这么久，而且饮食交通没国内那么方便。好在之前去过 越南 ，知道 东南亚 国家都是这样的经济状况，没过几天也适应了，后来慢慢的发现，自己还是挺享受这种简单的生活。至于历史上的恩怨只是老一辈人的谈资，年轻人还是很友好的。","text":"整理手机相册，发现还有一段回忆没整理，于是抽了这段闲暇时间把在 雅加达 的日子记录下来，希望有些经验也能帮到网友。 年初，因为出差的缘故，有幸去 雅加达 体验了一个多月的风土人情。刚开始我是十分不习惯的，毕竟异国他乡之前都没呆过这么久，而且饮食交通没国内那么方便。好在之前去过 越南 ，知道 东南亚 国家都是这样的经济状况，没过几天也适应了，后来慢慢的发现，自己还是挺享受这种简单的生活。至于历史上的恩怨只是老一辈人的谈资，年轻人还是很友好的。 机票是公司统一给订的，来回都坐的是南航， 广州 作为中转。还有是 香港 和 上海 也可以作为中转。广州 白云机场看到一架 越南 航空，想起两年前春节 越南 游，哈哈~到达 雅加达 ，一股热带气息扑面而来，刚下 广州 脱了羽绒换上长袖外套，到 雅加达 看着机场外面接机的人群都是短袖，感觉有点格格不入：）因为是商务签，入境的时候需要交300元，美刀好像能便宜点，但同事几个身上都没带。到那边公司宿舍已经是当地11点了，吃了碗挂面洗洗睡。。早晨醒来，，感觉很多地方还是挺破的。整个 雅加达 就是贫富悬殊的城市布局，眼下是高楼大厦耸立着，走几步路或许就是土阶茅屋。 饮食甲方公司怕我们吃不惯，都是提前约好让阿姨去买的，然后做好了带来，肉食基本都是这样鸡肉啊青蛙啊虾啊。味道是加了咖喱的那种，很独特。大肉大菜的吃得很饱。食堂里有之前那批人从国内带的老干妈和各种火锅调料，但我很少自己做着吃。这边的中式餐馆，菜品都挺贵的，不过味道比国内还好吃。马路边走着看到一个老人在摆摊，于是坐下来吃了一碗，老人还很热心得递给我一碗红茶，我向他竖了下拇指就开吃了。下面是粥一样的东西，上面是虾片和鸡肉丝，在 雅加达 任何地方都能见到鸡肉的身影，炸鸡烤鸡很常见也很便宜，虾片也是当地一大特色。和 越南 一样，物价便宜，这碗东西折合人民币才5块钱。有时候吃腻了公司统一提供的菜，下楼下的超市买个这种炸鸡套餐饭，折成人民币才7块钱。不过炸鸡得趁热好吃，去晚了就变得软了。 新年第一天跟着同事们一起去了baywalk mall，海港边的大商场，里面有新鲜的海味，可以自己挑好然后现做。每个人200人民币，还算是挺划算的。其中那个炸鱿鱼圈挺好吃的，哈哈当时还想当零食放点在兜里。毕竟靠近赤道的城市，热带水果还是挺多的，唯一感到奇怪的是没见到榴莲和山竹，，本来还想多吃点国内贵的东西呢 住宿公司健身房～这边的大厦很奇怪，汽车可以直接开上顶楼，有个像 盘山 公路一样的车道专门给汽车留着，而且停车库在楼上也有。 日常2017最后一天，鞭炮声不绝于耳，夜空都是烟花，很漂亮，路上骑摩托车的人们都停下来站在桥上看烟花。第一次在异国他乡跨年~ancol公园的码头，从这可以报旅行社去千岛群岛，到各个岛的都有，不过要去得早，8点多就没船去公主岛了。还要提前取现金，因为码头这唯一的一台ATM只支持visa。所以我没去成还摔了一跤（以下） 有个周末特别想去千岛群岛玩，因为同事们都去近点的景点浪了， 我就打了个grab去ancol公园，准备报旅行社独自去岛上，还没到公园半路就不小心被摩托车撞了，所幸只是点皮肉伤无大碍。唉，人在外面一定要注意安全，回程途中还遇到一个插曲，想取钱但ATM坏了，然后卡被吞了，我用英语解释了半天旁边人都没听懂，后来幸好有个工作人员出来，说卡要工作日去拿，然后我就把钱提出放弃了那张卡 。注意，这边当地人基本都只会印尼语，说英语还不如说中文。 独立广场早晨去的时候广场外正好有游行，没看懂标语。。国家纪念碑还是挺雄伟的，听说顶端那个是有金子做的。 中央公园中央公园是 雅加达 最大的综合商场之一吧。算是最繁华的地带，晚上灯光很美。 千岛群岛雅加达 北面海上点缀着几百个岛屿，有些是私人岛有些是居民岛。比较有名也比较美的几个岛屿：Palua，Pari，Sepa。可惜的是我都没有去，我跟着我们同事大部队去的是一个叫pramuka的居民岛，岛上虽然垃圾挺多，但海水清晰度还是赛过国内任何一个岛屿。 雅加达 湾上面的岛其实海水都挺好的，我们路过近海的ayer岛，从游艇上一眼望去都被惊艳到了。 刻骨铭心的是，去的一路上真的是差点被浪拍晕过去。因为我们都没经验，坐在了游艇上面一层，而这艘游艇上面没有窗户。刚开始开的时候都还兴奋的张来望去，开着开着就受不了海浪的冲击，浪花沿着船舷直接拍上来，无人能幸免。等到了岛上，我们有个同事甚至已经晕过去了，缓了好久才缓回来。回程都聪明的坐在了下层 。回去后我也差点感冒高烧。ayer岛岛上景色还是很美的，尤其是海水，海水中还有树立的几丛水草，可以望见水底。这种海水在国内可以说已经绝迹了，在印尼这边却是很常见的。 南航回程的餐食相比去程还是不错的，有面包有水果有牛肉饭还有红酒。","categories":[{"name":"旅行","slug":"旅行","permalink":"https://shen-yu.gitee.io/categories/%E6%97%85%E8%A1%8C/"}],"tags":[{"name":"旅行","slug":"旅行","permalink":"https://shen-yu.gitee.io/tags/%E6%97%85%E8%A1%8C/"},{"name":"东南亚","slug":"东南亚","permalink":"https://shen-yu.gitee.io/tags/%E4%B8%9C%E5%8D%97%E4%BA%9A/"}]},{"title":"春节越南行","slug":"春节越南行","date":"2017-01-27T12:25:55.000Z","updated":"2020-01-13T11:15:03.197Z","comments":true,"path":"2017/vietnam/","link":"","permalink":"https://shen-yu.gitee.io/2017/vietnam/","excerpt":"我的所爱，在海云之间。 最喜欢骑着摩托在海云岭上拉到最大马力的感觉~ 刚开始想去越南只是听朋友说物价便宜，人美景也美，尤其是有海滩，决定下来之后就开始查很多网友的攻略，后来发现看攻略根本记不住啥，说来说去都是这么几个注意点。上班的时候就没啥心思了，很期待这场旅行，本来假期就不多，春节正好可以躲避寒冬，于是约了个好友一起去，人均花费在4000左右吧，要是平时去估计能便宜一半。我选择了在年三十就出发，即使是这样，我们真正玩的时间也只有三天，有大半时间都浪费在了路上，不过这一路上的经历回想起来也挺有意思的。在此还是强烈推荐平时淡季去，春节机票贵，火车票又一票难求，如果是淡季去的话直飞是最爽快的了。","text":"我的所爱，在海云之间。 最喜欢骑着摩托在海云岭上拉到最大马力的感觉~ 刚开始想去越南只是听朋友说物价便宜，人美景也美，尤其是有海滩，决定下来之后就开始查很多网友的攻略，后来发现看攻略根本记不住啥，说来说去都是这么几个注意点。上班的时候就没啥心思了，很期待这场旅行，本来假期就不多，春节正好可以躲避寒冬，于是约了个好友一起去，人均花费在4000左右吧，要是平时去估计能便宜一半。我选择了在年三十就出发，即使是这样，我们真正玩的时间也只有三天，有大半时间都浪费在了路上，不过这一路上的经历回想起来也挺有意思的。在此还是强烈推荐平时淡季去，春节机票贵，火车票又一票难求，如果是淡季去的话直飞是最爽快的了。 我先是提前一个月抢到了从杭州到南宁的火车票，后来因为退票了只能去桂林中转，南宁到河内嘉林火车站的票也是提前2个星期在淘宝买的，签证淘宝只要240，3天就能出签还包邮。因为是春节，所有票都只能在网上买，机票啥的要比平时贵一半都不止。所以这次唯一的遗憾是没有提前抢好廉价机票。我推荐大家最好是提前抢好国内直飞岘港的廉价往返机票，这样可以省去好多时间。 至于旅行的路线，我觉得一个岘港就已经够了，去很多城市首先是累，再者浪费时间，因为越南的交通条件本身就不发达，一般距离较远的两个城市之间都是飞机或火车或sleeping bus，后面两个交通工具太慢了，春节期间的机票还死贵，所以我觉得玩一个岘港就足够了。我们在路上遇到的驴友也和我一样的观点，岘港有山有水有海滩，其他城市有的它都有，其他城市没有的它也有，所以好好的玩一个岘港，比在河内西贡芽庄美奈大叻岘港之间奔波要好得多。 要带的衣物不多，就一套短袖和一套长袖，还有穿去的一套厚的登山服，一路慢慢脱。签证、护照、充电器、充电宝这是必不可少的，除此之外带着足够的钱就可以了，转接插头也不用带，那边的两项插孔是完全兼容国内的插头的。 南宁——秀美的省会城市先是杭州东站坐火车到桂林，到桂林是第二天凌晨5点，还来不及看看漓江就坐上动车去南宁了，到南宁是第二天的中午，吃了碗米粉，比杭州的正宗，但比较脏，没有杭州的干净。接着去华夏银行换美元，发现银行的营业厅关门，然后我又跑了好几家，最后绝望的发现南宁市里所有银行正月初一都是休息的，只好在ATM自助机上取了1500人民币（不过后来根本没用到这些钱）。南宁给我的印象就是静静的，我最喜爱的是邕江。因为南宁到河内是晚上6点的火车，所以我下午打了辆的士决定去江滨公园逛逛，当开过邕江大桥的时候，第一眼就被它碧绿澄澈的水吸引了，这么干净的水在我们江浙一带是很少见的，它在阳光的照耀下波光粼粼，江边还有不少钓鱼的老头，游泳的小孩，散步的情侣。这一切构成了一副很安静闲适的画面，我当即拍下了这张照片。 嘉林——体验了国际列车在邕江逛到下午4点，就打车回火车站，坐上了去河内嘉林的火车。这趟国际列车和国内的绿皮火车一样，不过都是软卧，有隔开的包厢，还可以关门，睡着挺舒服，不过半夜要起来两次去过境边检，所以只能过了同登边检才能安心睡觉。 到同登边检站是十分激动的，毕竟千里迢迢的终于到越南了，为了到嘉林不至于没钱打车，我在这个入境边检的地方换了100元，汇率是3150，比河内市里ATM机取的汇率要低。火车凌晨5点多到嘉林，嘉林火车站很小很破，出来之后有卖手机卡和换钱的小店，我们好多人在这里买手机卡又被坑了，包括我，花了150k买的Viettel卡以为是无限流量，结果只有200m流量，用完之后又要花钱充值的。所以大家千万别急着买手机卡和换钱，如果不是很急的话还是建议到河内市里去买，另外手机卡先问清楚流量再买，我后来又花100k买了张3GB流量的卡，2号回来的时候还有2个G多出来。换越盾可以网上先查一下不收手续费的本地银行，华夏银行每月有一笔境外取现是免费的，就算有手续费也不会很多，不论何时何地，ATM机里取钱汇率都是最划算的。河内街上到处都是带着银联标志的ATM机，只要带着银行卡，不用担心没地方取越盾。 河内——值得品味的老街到河内是1月29号凌晨5点多，之后我们打车去了圣约瑟夫大教堂，从大教堂一路在巷子中绕来绕去，先在路边摊吃了碗米粉，那个米粉的味道真的超级好，第一口汤汁我就爱上它了，之后在岘港我也吃了好几碗米粉，但味道都没有河内的好。越南的店铺都有小的青柠檬和朝天椒作为调味料，在米粉中挤点柠檬汁，再放点辣椒酱，味道比国内任何面啊粉啊都要好吃。吃完后我们走到还剑湖边，我在ATM机取了921人民币，300万越盾，那一刻确实有一种变身百万富翁的错觉哈哈。算了一下汇率有3257，比任何地方换都要高了。 换好钱我们在还剑湖周边的大街小巷乱逛了一通，体验了一下越南的风土人情。越南的建筑都很有特色，毕竟曾是法国的殖民地，所以大到大教堂，小到小酒馆，都很有法式风情。越南的贫富差距严重，大多数人都骑摩托车，街上还停着不少限量豪车。其他我感触最深的一点就是，街上太乱了！！连河内这个首都也很少有红绿灯，放眼望去，基本都是摩托车，在大街上走你千万不能玩手机或者左顾右盼，要快速地小跑而过。街边乱停乱放的现象也十分普遍，除非有撞伤人了，不然根本没有交警会来管。有些撞人事故也是自己处理的，我在路上就正好遇到一个被撞的妇女，本来以为会有交警来处理，结果那女的和司机都拍拍屁股就走了，好像什么事情都没发生过一样。 因为正好是春节，所以还剑湖周边都很有节日气氛，不同国籍的人坐在咖啡馆晒着太阳听着歌闲聊，街上吆喝的小贩，湖边摩肩接踵的人流，这些都比国内要热闹不少。 我们在还剑湖边上的一个旅行社买了晚上去岘港的sleeping bus汽车票，后来才知道260元人民币的价格买贵了，网上查的新咖啡也只要100多就行了。所以最好是去open bus的官网预定好。越南的open bus有好几家，我们坐的是camel bus，设施还算干净，只是旁边过道上也有人睡，味道难闻。 晚上6点我们就坐上这个bus，第二天凌晨5点到了顺化，我们决定提前下车了，一是因为实在呆不下去，二是因为想看看顺化到岘港那段火车沿途的美景。这个sleeping bus根本无法sleep，不同国籍的人脱了鞋子挤在一个车厢里，味道真是酸爽，巴士开得还摇摇晃晃的，晚上我是一刻都没睡着。 凌晨我们在下车的旅行社遇到了几个也打算坐火车去岘港的中国小伙伴，跟着他们走到火车站买了票，因为网上都说顺化没啥好看的，所以我们没在顺化停留。 岘港——惊艳于海云之间火车去岘港的途中一路美景，灵姑湾到海云岭的这一段山路被National Geographic票选为人生必去的50景之一。我们去的那天正好阳光明媚，一路的海边公路上骑摩托的人，海水在阳光照耀下波光粼粼，简直是美cry！ 这段路真的是这段旅行中最最让我觉得惊艳的，当时完全不顾手机容量够不够，只管一直按拍照键，回到宾馆一看，每一张都是美景。 到了岘港后，我们就找了个sea view的宾馆先放行李，450k，其实只看得到一点点海，因为没有visa的卡，所以无法在booking上预定，只能一家家走过去问价格，真正的海景房一般都要800k+，很多还没房间了。 因为在sleeping bus上根本没睡着过，我到了宾馆洗了个澡倒头就睡，小伙伴自己去玩了，醒来是傍晚6点了，下楼花150k租了一辆motorbike，很多好看的摩托已经被租掉了，只能选了辆外观一般的。摩托店的老板不错，还手把手教我怎么打火熄火，发着后要一点点给油才不至于熄火，还告诉我哪些按钮对应哪些灯。自动挡的摩托车还是挺简单的，唯一的难点是打火，打着后就和电瓶车差不多，而且越南的摩托开起来很爽，不断给油可以跑得比汽车还快，加速也很快，超车啥的最爽，减油后停得也很快，所以开习惯之后还是挺安全的。 我适应了一会儿马上就掌握了要领，问了路边的一个小哥加油站的位置，花了60k加满油，这还是挺划算的，折合人民币20元，能开一天。我晚上从美溪沙滩开到乐天超市一个来回，第二天又去海云关一个来回，回来油箱还有的剩下。 加完油我按着地图的指示去了乐天超市买了一双人字拖，买了点酸奶喝，还买了几盒咖啡打算带回去。在这里提一下越南的物价吧，越南的物价比国内普遍要便宜30%左右，酸奶很正宗，而且比国内便宜一半都不止，咖啡也很正宗，很多咖啡都停止出口到中国了，但在这里的超市都买得到。 超市的停车场都是摩托，却鲜有汽车，进去门卫会给你个号码，出来后再把号码还给他，在越南停车都是免费的。 在超市买完东西，我又骑着摩托沿着美溪海岸开了一圈，美溪沙滩人很少，海水还算干净，浪有点大，适合冲浪，不过我没敢下水，海风吹着脸庞，听浪潮拍打的声音，感觉超级relax。 回宾馆又是倒头就睡，之前听朋友说去海云关骑摩托很爽，所以第二天开着摩托沿着岘港的海岸公路，去海云关和灵姑湾溜达了一圈，大晴天的在海岸线上开摩托车真是超级爽，可惜后来到海云关就下毛毛雨了，山上很冷，想去的朋友一定要提前带件外套，我在回来之后头都被冻得很晕，要不是及时洗个热水澡吃了点辣椒驱寒，肯定会发烧。海云关是我在岘港玩得最high的一个地方，沿着盘山公路开上去，可以开得比汽车还快，旁边就是一望无际的大海。一下子就感觉好自由，所有烦恼都没有，心胸也一下子开阔了。 早晨来到美溪沙滩拍了张全景照岘港的dragon bridge海云关上还是有不少中国人的，在此一个河南大哥帮我拍了一张。 会安——灯火阑珊的古镇在岘港玩了一天，傍晚我被朋友拉着去了会安，在印象里，会安古镇只有晚上几盏灯笼比较好看，除此之外还有一个占婆岛值得一玩。但这次去，我感到遗憾的是，到会安的那天正好下雨，所以只能在会安古镇的小餐馆喝喝咖啡吃点米粉，去占婆岛潜水的计划完全泡汤了。不过会安古镇热闹繁华的夜晚还是给我留下了深刻的印象，路边有很多各种好吃的小吃，抬头一望总能看到五颜六色的灯笼，旁边还时而走过几个美女，视觉和味觉都能得到很好的满足。会安的很多hotel都有小泳池，可以惬意的游一圈，但天气有点冷，再加上那天受凉了，所以没下水。价格比岘港只多了50k，却是3星级的，设施环境啥的都比较好。 逛完会安古镇，回到宾馆洗个热水澡，出了一身汗，第二天就没受凉头晕的感觉了，本来想去占婆岛，不过天公不作美，只能在古镇到处走走。找了个小咖啡馆喝滴壶咖啡喝到下午，打算回岘港，不过出租车都要100人民币的样子，网上查了一下有巴士直接到岘港的，是黄色车身的大巴，具体是在下面地图的黄色标注位置。 下面是一些雨天在会安街上闲逛时拍的风景。这好像是一所大学，具体叫什么名字我不认识，大门开着我就进去了，后来又被里面的员工赶出来了。里面风景还是不错的，教学楼一律是古黄色，凳子，不知名的植物，在下雨天中别有一番味道。 从会安回岘港的巴士上又是一段值得回忆的经历。我首先向旁边一个老外打了招呼，问他这辆车到岘港的哪里，然后我俩就聊起来了，后来得知他是从澳大利亚移民到越南的，再然后，我们互相吐槽中国和澳大利亚的房价和物价高，赞越南的物价和女人，他说在澳大利亚他有big house和nice car，但是not happy，从刚到越南至现在的6年里，他找回了自己，他每天都过得开心。在得知我要找个靠近机场的旅馆后，还热心的打算帮我安排住处，到岘港后，我跟着他来到他妻子的家里，把我介绍给了他的越南家人，让他的Vietnamese Lady帮我找了个靠近机场的旅馆。 晚上出去逛了一圈，还交了几个当地的朋友，我的感觉是，越南年轻人对国人还是挺友好的，他们对我们就像是我们对日本人，有敬畏也有崇拜，或许也有一点敌视吧，但我这次旅行接触的当地人对我都挺友好，他们请我一起喝啤酒，虽然我们语言不通，但翻译软件的帮助下还是可以勉强交流的，最后还互相加了facebook。 爱上岘港，爱上越南在岘港和会安玩了2天，越南之旅也算是到尾声了，离开前的一早我还在街边吃了本趟越南之行的最后一碗米粉，出奇的好吃，比河内的还要好吃，折成人民币才5元，搞得我更加舍不得岘港这座城市了。 从岘港回河内说什么也不能再坐sleeping bus了，飞机虽然花了我560元，加上托运费360k，加起来将近700（这也是没提前做好安排的代价），但飞机的好处是快，不会那么累。 回到河内才下午3点，离晚上嘉林回南宁火车的发车时间还有好几个小时，就趁机场大巴在乐天停下的时候提早下车了，买了不少路上吃的零食，买了些干米粉带给家人，河内的乐天超市物价比岘港还要便宜，小包的咖啡才20k都不到，小瓶的可乐折算成人民币才1块多。购物完毕我们就打车去了嘉林火车站，在此提醒大家，绿色的taxi跳表是最快的，也是最贵的，我们从长钱商场到嘉林火车站就要90k越盾，原先我们以为越盾会多出来，还打算换成人民币，最后发现不够打的，正好在嘉林火车站门口的小店里碰到几个要换越盾的妹子，就又换了100k越盾，剩下的越盾回家留着做纪念。 我感到奇怪的是，河内回南宁的火车上并没什么人，但淘宝上问了好几家都说没票了，估计是被黄牛搞的。第二天回杭州的火车是11点在南宁站发车，之前还担心河内到南宁的火车会晚点，但后来问了列车上的工作人员，事实也证明，这趟国际列车很少会发生晚点。","categories":[{"name":"旅行","slug":"旅行","permalink":"https://shen-yu.gitee.io/categories/%E6%97%85%E8%A1%8C/"}],"tags":[{"name":"旅行","slug":"旅行","permalink":"https://shen-yu.gitee.io/tags/%E6%97%85%E8%A1%8C/"},{"name":"东南亚","slug":"东南亚","permalink":"https://shen-yu.gitee.io/tags/%E4%B8%9C%E5%8D%97%E4%BA%9A/"}]},{"title":"手机摄影学习笔记","slug":"手机摄影学习笔记","date":"2016-09-07T07:06:00.000Z","updated":"2020-05-03T01:31:48.901Z","comments":true,"path":"2016/shoujisheying/","link":"","permalink":"https://shen-yu.gitee.io/2016/shoujisheying/","excerpt":"焦距1.广角：28mm，长焦8002.光圈","text":"焦距1.广角：28mm，长焦8002.光圈 构图基础1.机位（站在哪里）2.视点（不正常的视角）3.层次（近中远），拍海滩要有前景4.简化小景深，剪影，纯色背景，留白 构图进阶1.立体透视：要么完全立体透视，要么完全平面化2.对比：大小对比，动静对比，明暗对比，虚实对比，（贴在玻璃上就不会有反光）3.质感3.形式（中央，对称，重复，突变，框架） 平面构成1.点线面 软件procam，slowshutter,snapseed黄金分割线最佳兴趣点辅助线黄金螺旋线","categories":[{"name":"学习","slug":"学习","permalink":"https://shen-yu.gitee.io/categories/%E5%AD%A6%E4%B9%A0/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://shen-yu.gitee.io/tags/%E9%9A%8F%E7%AC%94/"},{"name":"学习","slug":"学习","permalink":"https://shen-yu.gitee.io/tags/%E5%AD%A6%E4%B9%A0/"},{"name":"摄影","slug":"摄影","permalink":"https://shen-yu.gitee.io/tags/%E6%91%84%E5%BD%B1/"}]}]}